app/Http/Controllers/CompteController.php

select count(*) as aggregate from "comptes" where "comptes"."deleted_at" is null
---
    public function index(CompteListRequest $request): JsonResponse
    {
        $limit = $request->get('limit', 10);
        $comptes = Compte::applyFiltersAndPagination($request)->paginate($limit);