app/Models/Compte.php

    public function getSoldeAttribute()
    {
        $totalDepots = $this->transactions()->where('type', 'depot')->sum('montant');
        $totalRetraits = $this->transactions()->where('type', 'retrait')->sum('montant');
---
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 2 and "transactions"."compte_id" is not null and "type" = 'retrait'
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 4 and "transactions"."compte_id" is not null and "type" = 'retrait'